 //MOULI02 JOB (123),'LOAD VSAM',CLASS=A,MSGCLASS=A,NOTIFY=&SYSUID
 //STEP1 EXEC PGM=IDCAMS
 //SYSPRINT DD SYSOUT=*
 //INFILE DD DSN=A016.MOULI.VSAM.DATA,DISP=SHR
 //OUTFILE DD DSN=A016.MOULI.KSDS,DISP=SHR
 //SYSIN DD *
   REPRO INFILE(INFILE) -
         OUTFILE(OUTFILE)
 /*
